; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c6-s3-p16-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 c3 c4 c5 
          t0 t1 t2 t3 t4 t5 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 l4-0 l4-1 l4-2 l5-0 l5-1 l5-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-2)
    (at t3 l3-1)
    (at t4 l4-2)
    (at t5 l5-0)
    (at p0 l2-1)
    (at p1 l0-1)
    (at p2 l5-1)
    (at p3 l1-0)
    (at p4 l1-0)
    (at p5 l4-2)
    (at p6 l2-0)
    (at p7 l2-2)
    (at p8 l0-2)
    (at p9 l1-1)
    (at p10 l1-0)
    (at p11 l1-2)
    (at p12 l3-1)
    (at p13 l0-2)
    (at p14 l0-2)
    (at p15 l3-0)
    (at a0 l3-0)
    (at a1 l5-0)
)
(:goal
    (and
        (at p0 l1-1)
        (at p1 l1-1)
        (at p2 l5-0)
        (at p3 l2-2)
        (at p4 l0-1)
        (at p5 l5-0)
        (at p6 l1-2)
        (at p7 l0-1)
        (at p8 l1-1)
        (at p9 l3-2)
        (at p10 l0-2)
        (at p11 l2-0)
        (at p12 l3-2)
        (at p13 l4-1)
        (at p14 l0-1)
        (at p15 l5-2)
    )
)
)

; plan
1. (load-truck p5 t4 l4-2)
   deleted: (at p5 l4-2)
   added: (in p5 t4)
   goals met: 0 of 16
2. (drive-truck t4 l4-2 l4-0 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-0)
   goals met: 0 of 16
3. (unload-truck p5 t4 l4-0)
   deleted: (in p5 t4)
   added: (at p5 l4-0)
   goals met: 0 of 16
4. (load-truck p12 t3 l3-1)
   deleted: (at p12 l3-1)
   added: (in p12 t3)
   goals met: 0 of 16
5. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 16
6. (load-truck p7 t2 l2-2)
   deleted: (at p7 l2-2)
   added: (in p7 t2)
   goals met: 0 of 16
7. (fly-airplane a1 l5-0 l0-0)
   deleted: (at a1 l5-0)
   added: (at a1 l0-0)
   goals met: 0 of 16
8. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 16
9. (load-airplane p4 a1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a1)
   goals met: 0 of 16
10. (load-airplane p3 a1 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a1)
   goals met: 0 of 16
11. (load-airplane p10 a1 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 a1)
   goals met: 0 of 16
12. (load-airplane p15 a0 l3-0)
   deleted: (at p15 l3-0)
   added: (in p15 a0)
   goals met: 0 of 16
13. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 0 of 16
14. (load-airplane p5 a0 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 a0)
   goals met: 0 of 16
15. (fly-airplane a0 l4-0 l5-0)
   deleted: (at a0 l4-0)
   added: (at a0 l5-0)
   goals met: 0 of 16
16. (unload-airplane p5 a0 l5-0)
   deleted: (in p5 a0)
   added: (at p5 l5-0)
   goals met: 1 of 16
17. (unload-airplane p15 a0 l5-0)
   deleted: (in p15 a0)
   added: (at p15 l5-0)
   goals met: 1 of 16
18. (load-truck p15 t5 l5-0)
   deleted: (at p15 l5-0)
   added: (in p15 t5)
   goals met: 1 of 16
19. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 16
20. (load-truck p2 t5 l5-1)
   deleted: (at p2 l5-1)
   added: (in p2 t5)
   goals met: 1 of 16
21. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 16
22. (unload-truck p2 t5 l5-0)
   deleted: (in p2 t5)
   added: (at p2 l5-0)
   goals met: 2 of 16
23. (drive-truck t5 l5-0 l5-2 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-2)
   goals met: 2 of 16
24. (unload-truck p15 t5 l5-2)
   deleted: (in p15 t5)
   added: (at p15 l5-2)
   goals met: 3 of 16
25. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 3 of 16
26. (unload-truck p12 t3 l3-2)
   deleted: (in p12 t3)
   added: (at p12 l3-2)
   goals met: 4 of 16
27. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 4 of 16
28. (load-truck p0 t2 l2-1)
   deleted: (at p0 l2-1)
   added: (in p0 t2)
   goals met: 4 of 16
29. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 4 of 16
30. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 4 of 16
31. (load-truck p9 t1 l1-1)
   deleted: (at p9 l1-1)
   added: (in p9 t1)
   goals met: 4 of 16
32. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 4 of 16
33. (unload-truck p9 t1 l1-0)
   deleted: (in p9 t1)
   added: (at p9 l1-0)
   goals met: 4 of 16
34. (load-airplane p9 a1 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 a1)
   goals met: 4 of 16
35. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 4 of 16
36. (load-truck p11 t1 l1-2)
   deleted: (at p11 l1-2)
   added: (in p11 t1)
   goals met: 4 of 16
37. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 4 of 16
38. (unload-truck p11 t1 l1-0)
   deleted: (in p11 t1)
   added: (at p11 l1-0)
   goals met: 4 of 16
39. (load-airplane p11 a1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a1)
   goals met: 4 of 16
40. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 4 of 16
41. (load-truck p1 t0 l0-1)
   deleted: (at p1 l0-1)
   added: (in p1 t0)
   goals met: 4 of 16
42. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 4 of 16
43. (unload-truck p1 t0 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 4 of 16
44. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 4 of 16
45. (load-truck p8 t0 l0-2)
   deleted: (at p8 l0-2)
   added: (in p8 t0)
   goals met: 4 of 16
46. (load-truck p14 t0 l0-2)
   deleted: (at p14 l0-2)
   added: (in p14 t0)
   goals met: 4 of 16
47. (load-truck p13 t0 l0-2)
   deleted: (at p13 l0-2)
   added: (in p13 t0)
   goals met: 4 of 16
48. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 4 of 16
49. (unload-truck p14 t0 l0-1)
   deleted: (in p14 t0)
   added: (at p14 l0-1)
   goals met: 5 of 16
50. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 5 of 16
51. (unload-truck p8 t0 l0-0)
   deleted: (in p8 t0)
   added: (at p8 l0-0)
   goals met: 5 of 16
52. (unload-truck p13 t0 l0-0)
   deleted: (in p13 t0)
   added: (at p13 l0-0)
   goals met: 5 of 16
53. (fly-airplane a0 l5-0 l4-0)
   deleted: (at a0 l5-0)
   added: (at a0 l4-0)
   goals met: 5 of 16
54. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 5 of 16
55. (unload-truck p7 t2 l2-0)
   deleted: (in p7 t2)
   added: (at p7 l2-0)
   goals met: 5 of 16
56. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 5 of 16
57. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 5 of 16
58. (load-airplane p7 a1 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 a1)
   goals met: 5 of 16
59. (load-airplane p6 a1 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a1)
   goals met: 5 of 16
60. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 5 of 16
61. (unload-airplane p6 a1 l1-0)
   deleted: (in p6 a1)
   added: (at p6 l1-0)
   goals met: 5 of 16
62. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 5 of 16
63. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 5 of 16
64. (unload-truck p6 t1 l1-2)
   deleted: (in p6 t1)
   added: (at p6 l1-2)
   goals met: 6 of 16
65. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 6 of 16
66. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 6 of 16
67. (unload-airplane p3 a1 l2-0)
   deleted: (in p3 a1)
   added: (at p3 l2-0)
   goals met: 6 of 16
68. (load-truck p3 t2 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 t2)
   goals met: 6 of 16
69. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 6 of 16
70. (unload-truck p3 t2 l2-2)
   deleted: (in p3 t2)
   added: (at p3 l2-2)
   goals met: 7 of 16
71. (unload-airplane p11 a1 l2-0)
   deleted: (in p11 a1)
   added: (at p11 l2-0)
   goals met: 8 of 16
72. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 8 of 16
73. (fly-airplane a1 l1-0 l3-0)
   deleted: (at a1 l1-0)
   added: (at a1 l3-0)
   goals met: 8 of 16
74. (unload-airplane p9 a1 l3-0)
   deleted: (in p9 a1)
   added: (at p9 l3-0)
   goals met: 8 of 16
75. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 8 of 16
76. (load-truck p9 t3 l3-0)
   deleted: (at p9 l3-0)
   added: (in p9 t3)
   goals met: 8 of 16
77. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 8 of 16
78. (unload-truck p9 t3 l3-2)
   deleted: (in p9 t3)
   added: (at p9 l3-2)
   goals met: 9 of 16
79. (fly-airplane a1 l3-0 l0-0)
   deleted: (at a1 l3-0)
   added: (at a1 l0-0)
   goals met: 9 of 16
80. (load-airplane p8 a1 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 a1)
   goals met: 9 of 16
81. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 9 of 16
82. (unload-airplane p8 a1 l1-0)
   deleted: (in p8 a1)
   added: (at p8 l1-0)
   goals met: 9 of 16
83. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 9 of 16
84. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 9 of 16
85. (unload-truck p8 t1 l1-1)
   deleted: (in p8 t1)
   added: (at p8 l1-1)
   goals met: 10 of 16
86. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 10 of 16
87. (unload-airplane p7 a1 l0-0)
   deleted: (in p7 a1)
   added: (at p7 l0-0)
   goals met: 10 of 16
88. (load-truck p7 t0 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 10 of 16
89. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 10 of 16
90. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 10 of 16
91. (unload-truck p7 t0 l0-1)
   deleted: (in p7 t0)
   added: (at p7 l0-1)
   goals met: 11 of 16
92. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 11 of 16
93. (unload-airplane p4 a1 l0-0)
   deleted: (in p4 a1)
   added: (at p4 l0-0)
   goals met: 11 of 16
94. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 11 of 16
95. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 11 of 16
96. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 11 of 16
97. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 11 of 16
98. (unload-truck p4 t0 l0-1)
   deleted: (in p4 t0)
   added: (at p4 l0-1)
   goals met: 12 of 16
99. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 12 of 16
100. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 12 of 16
101. (load-airplane p13 a1 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 a1)
   goals met: 12 of 16
102. (unload-airplane p10 a1 l0-0)
   deleted: (in p10 a1)
   added: (at p10 l0-0)
   goals met: 12 of 16
103. (load-truck p10 t0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 t0)
   goals met: 12 of 16
104. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 12 of 16
105. (unload-truck p10 t0 l0-2)
   deleted: (in p10 t0)
   added: (at p10 l0-2)
   goals met: 13 of 16
106. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 13 of 16
107. (fly-airplane a1 l1-0 l4-0)
   deleted: (at a1 l1-0)
   added: (at a1 l4-0)
   goals met: 13 of 16
108. (unload-airplane p13 a1 l4-0)
   deleted: (in p13 a1)
   added: (at p13 l4-0)
   goals met: 13 of 16
109. (load-truck p13 t4 l4-0)
   deleted: (at p13 l4-0)
   added: (in p13 t4)
   goals met: 13 of 16
110. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 13 of 16
111. (unload-truck p13 t4 l4-1)
   deleted: (in p13 t4)
   added: (at p13 l4-1)
   goals met: 14 of 16
112. (fly-airplane a0 l4-0 l0-0)
   deleted: (at a0 l4-0)
   added: (at a0 l0-0)
   goals met: 14 of 16
113. (load-airplane p1 a0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 14 of 16
114. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 14 of 16
115. (unload-airplane p1 a0 l1-0)
   deleted: (in p1 a0)
   added: (at p1 l1-0)
   goals met: 14 of 16
116. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 14 of 16
117. (load-truck p1 t1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t1)
   goals met: 14 of 16
118. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 14 of 16
119. (unload-truck p1 t1 l1-1)
   deleted: (in p1 t1)
   added: (at p1 l1-1)
   goals met: 15 of 16
120. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 15 of 16
121. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 15 of 16
122. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 15 of 16
123. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 15 of 16
124. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 15 of 16
125. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 15 of 16
126. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 15 of 16
127. (unload-truck p0 t1 l1-1)
   deleted: (in p0 t1)
   added: (at p0 l1-1)
   goals met: 16 of 16
